{
  "testimonials": [
    {
      "id": 1,
      "name": "Alexandra Thompson",
      "role": "Head of Energy Trading",
      "company": "GreenPower Solutions",
      "avatar": "/images/testimonials/alexandra.jpg",
      "content": "Kirankumar's BESS optimization engine transformed our trading operations. His MILP-based approach delivered a consistent 12% improvement in profitability while reducing battery degradation by 15%. The production-ready system he built handles our entire 4GW portfolio seamlessly.",
      "rating": 5,
      "featured": true
    },
    {
      "id": 2,
      "name": "Dr. Marcus Rivera",
      "role": "Principal Research Scientist",
      "company": "TechFlow AI",
      "avatar": "/images/testimonials/marcus.jpg",
      "content": "Outstanding work on multi-agent reinforcement learning systems. Kirankumar's innovative approach to airspace management achieved a 40% throughput increase while maintaining safety protocols. His technical depth in MARL is exceptional.",
      "rating": 5,
      "featured": true
    },
    {
      "id": 3,
      "name": "Elena Kowalski",
      "role": "VP of Engineering",
      "company": "EnergyTech Dynamics",
      "avatar": "/images/testimonials/elena.jpg",
      "content": "Kirankumar brings rare expertise in energy storage optimization. His real-time scheduling algorithms for our 100+ MW marine charging infrastructure exceeded expectations. Professional, detail-oriented, and delivers results.",
      "rating": 5,
      "featured": true
    },
    {
      "id": 4,
      "name": "Jordan Clarke",
      "role": "Senior Data Scientist",
      "company": "CloudVision Labs",
      "avatar": "/images/testimonials/jordan.jpg",
      "content": "Collaborated with Kirankumar on computer vision projects using Vision Transformers. His implementation achieved 18% accuracy improvement over existing benchmarks in GPS-denied navigation. Impressive problem-solving skills and clean code.",
      "rating": 5,
      "featured": false
    },
    {
      "id": 5,
      "name": "Dr. Priya Sharma",
      "role": "Professor of AI & Robotics",
      "company": "Metropolitan Institute of Technology",
      "avatar": "/images/testimonials/priya.jpg",
      "content": "Kirankumar's research contributions in autonomous navigation are significant. His ViT-SLAM integration work represents a major advancement in the field. Excellent technical writing and presentation skills.",
      "rating": 5,
      "featured": false
    },
    {
      "id": 6,
      "name": "Benjamin Foster",
      "role": "Lead Trading Analyst",
      "company": "PowerGrid Analytics",
      "avatar": "/images/testimonials/benjamin.jpg",
      "content": "Working with Kirankumar on energy market forecasting was excellent. His probabilistic models and MILP optimization expertise helped us achieve sub-second decision making in volatile markets. Highly recommend his services.",
      "rating": 5,
      "featured": false
    },
    {
      "id": 7,
      "name": "Sophia Martinez",
      "role": "AI Engineering Manager",
      "company": "Neural Systems Corp",
      "avatar": "/images/testimonials/sophia.jpg",
      "content": "Kirankumar delivered exceptional results on our ML infrastructure project. His experience with PyTorch, production-grade Python, and scalable systems made him invaluable to our team. Strong technical leadership.",
      "rating": 5,
      "featured": false
    },
    {
      "id": 8,
      "name": "Oliver Mitchell",
      "role": "CTO",
      "company": "SmartGrid Innovations",
      "avatar": "/images/testimonials/oliver.jpg",
      "content": "Brought Kirankumar in as a consultant for our BESS deployment strategy. His end-to-end system design and market expertise were crucial to our success. Professional delivery and excellent communication throughout.",
      "rating": 5,
      "featured": false
    }
  ]
}